# هذا الملف يخص بالتقنيين وفيه نطلع على قاعدة البيانات ونفهمها ونعرف هيكلها قبل أن نقوم بعملية التحليل والتنظيف والتحليل الاستكشافي لها

# الخطوة الأولى:
 ### معرفة هل تستجيب قاعدة البيانات

In [1]:
%%sql
SELECT * from eggProdu;

      Year Period Geo_Level  State_ANSI  Commodity_ID          Value
0     2023    APR     STATE         1.0             7    224,100,000
1     2023    APR     STATE         5.0             7    319,000,000
2     2023    APR     STATE         6.0             7    271,300,000
3     2023    APR     STATE         8.0             7     52,200,000
4     2023    APR     STATE        13.0             7    437,800,000
...    ...    ...       ...         ...           ...            ...
6322  1948   YEAR     STATE        27.0             7  3,646,000,000
6323  1947   YEAR     STATE        27.0             7  3,693,000,000
6324  1946   YEAR     STATE        27.0             7  3,899,000,000
6325  1945   YEAR     STATE        27.0             7  3,907,000,000
6326  1944   YEAR     STATE        27.0             7  3,718,000,000

[6327 rows x 6 columns]

# الخطوة الثانية:
 ### معرفة هيكل قاعدة البيانات

In [2]:
%%sql
pragma table_info(eggProdu);

 -- هذا الأمر يعطينا هيكل الجدول وأسماء الأعمدة وأنواع البيانات

   cid          name     type  notnull  dflt_value  pk
0    0          Year  INTEGER        0         NaN   0
1    1        Period     TEXT        0         NaN   0
2    2     Geo_Level     TEXT        0         NaN   0
3    3    State_ANSI  INTEGER        0         NaN   0
4    4  Commodity_ID  INTEGER        0         NaN   0
5    5         Value     TEXT        0         NaN   0

# الخطوة الثالثة:
 ### معرفة البيانات الفارغة 
 ### بهدف إجراء عملية تنظيف لها

In [7]:
%%sql
SELECT * from eggProdu 
where State_ANSI is null;

     Year Period Geo_Level  State_ANSI  Commodity_ID        Value
0    2023    APR     STATE         NaN             7  747,300,000
1    2023    FEB     STATE         NaN             7  689,100,000
2    2023    JAN     STATE         NaN             7  767,700,000
3    2023    MAR     STATE         NaN             7  763,300,000
4    2023    MAY     STATE         NaN             7  775,700,000
..    ...    ...       ...         ...           ...          ...
196  2008    MAY     STATE         NaN             7  505,000,000
197  2008    NOV     STATE         NaN             7  497,000,000
198  2008    OCT     STATE         NaN             7  506,000,000
199  2008    SEP     STATE         NaN             7  497,000,000
200  2007    DEC     STATE         NaN             7  527,000,000

[201 rows x 6 columns]

In [13]:
%%sql
SELECT * from honeyProdu 
where honeyProdu.State_ANSI is null;

    Year Geo_Level  State_ANSI  Commodity_ID      Value
0   2022     STATE         NaN             2  3,316,000
1   2021     STATE         NaN             2  1,349,000
2   2020     STATE         NaN             2  1,375,000
3   2019     STATE         NaN             2  1,418,000
4   2018     STATE         NaN             2  1,399,000
5   2017     STATE         NaN             2  1,518,000
6   2016     STATE         NaN             2  1,601,000
7   2015     STATE         NaN             2  1,168,000
8   2014     STATE         NaN             2  1,404,000
9   2013     STATE         NaN             2  1,295,000
10  2012     STATE         NaN             2  1,389,000
11  2011     STATE         NaN             2  1,156,000
12  2010     STATE         NaN             2  1,168,000
13  2009     STATE         NaN             2  1,348,000
14  2008     STATE         NaN             2    817,000
15  2007     STATE         NaN             2    720,000
16  2006     STATE         NaN             2    672,000
17  2005     STATE         NaN             2    645,000
18  2004     STATE         NaN             2    765,000
19  2003     STATE         NaN             2    352,000
20  2002     STATE         NaN             2    453,000
21  2001     STATE         NaN             2    303,000
22  2000     STATE         NaN             2    728,000
23  1999     STATE         NaN             2    681,000
24  1998     STATE         NaN             2  1,008,000
25  1997     STATE         NaN             2  1,134,000
26  1996     STATE         NaN             2    217,000
27  1995     STATE         NaN             2    264,000
28  1994     STATE         NaN             2    222,000
29  1993     STATE         NaN             2    360,000
30  1992     STATE         NaN             2    234,000
31  1991     STATE         NaN             2    252,000

In [11]:
%%sql
SELECT * from milkProdu 
where State_ANSI is null;

   Year Period Geo_Level  State_ANSI  Commodity_ID Domain      Value
0  2022   YEAR     STATE         NaN             5  TOTAL  5,000,000
1  2021   YEAR     STATE         NaN             5  TOTAL  5,500,000
2  2020   YEAR     STATE         NaN             5  TOTAL  4,800,000
3  2019   YEAR     STATE         NaN             5  TOTAL  4,900,000

In [14]:
%%sql
select * from cheeseProdu
where State_ANSI is null;

     Year Period Geo_Level  State_ANSI  Commodity_ID Domain        Value
0    2023    APR     STATE         NaN             6  TOTAL  215,206,000
1    2023    FEB     STATE         NaN             6  TOTAL  196,281,000
2    2023    JAN     STATE         NaN             6  TOTAL  259,418,000
3    2023    MAR     STATE         NaN             6  TOTAL  221,694,000
4    2022    APR     STATE         NaN             6  TOTAL  209,955,000
..    ...    ...       ...         ...           ...    ...          ...
448  1974   YEAR     STATE         NaN             6  TOTAL   33,610,000
449  1973   YEAR     STATE         NaN             6  TOTAL   27,858,000
450  1972   YEAR     STATE         NaN             6  TOTAL   40,823,000
451  1971   YEAR     STATE         NaN             6  TOTAL   30,660,000
452  1970   YEAR     STATE         NaN             6  TOTAL   22,847,000

[453 rows x 7 columns]

### الخطوة الرابعة: لدينا عمود القيم بنوع بيانات نص و المفروض يكون نوعه أرقام، سنقوم بتحويله إلى أرقام

In [31]:
%%sql
 -- احذف الفواصل من الأرقام كخطوة أولى لتحويل البيانات إلى أرقام
 
update eggProdu set Value = replace(Value, ',', '')
    where Value like '%,%';

In [33]:
%%sql
select * from eggProdu;

 -- تم حذف الفواصل بنجاح لنقم بعمل هذا لكافة الجداول

      Year Period Geo_Level  State_ANSI  Commodity_ID       Value
0     2023    APR     STATE         1.0             7   224100000
1     2023    APR     STATE         5.0             7   319000000
2     2023    APR     STATE         6.0             7   271300000
3     2023    APR     STATE         8.0             7    52200000
4     2023    APR     STATE        13.0             7   437800000
...    ...    ...       ...         ...           ...         ...
6322  1948   YEAR     STATE        27.0             7  3646000000
6323  1947   YEAR     STATE        27.0             7  3693000000
6324  1946   YEAR     STATE        27.0             7  3899000000
6325  1945   YEAR     STATE        27.0             7  3907000000
6326  1944   YEAR     STATE        27.0             7  3718000000

[6327 rows x 6 columns]

In [ ]:
%%sql
update honeyProdu set Value = replace(Value, ',', '')
    where Value like '%,%';

In [ ]:
%%sql

update milkProdu set Value = replace(Value, ',', '')
    where Value like '%,%';

In [ ]:
%%sql
update cheeseProdu set Value = replace(Value, ',', '')
    where Value like '%,%';

In [ ]:
%%sql
update YougertProdu set Value = replace(Value, ',', '')
    where Value like '%,%';

In [ ]:
%%sql
    update coffeeProdu set Value = replace(Value, ',', '')
    where Value like '%,%';

In [48]:
%%sql
 -- test
select Value from YougertProdu;

    -- تمت إزالة الفواصل ،جاهز للتحويل إلى أرقام!

         Value
0    377839000
1    793256000
2    374637000
3    774881000
4    354906000
..         ...
144   11058000
145  189012000
146    2545000
147   18988000
148   10868000

[149 rows x 1 columns]

 ## الخطوة الخامسة:إضافة عمود جديد لتحويل القيم إليه

In [ ]:
%%sql
Alter Table eggProdu
add column New_Values integer;
 -- نضيف عمود جديد لتحويل القيم إليه

In [ ]:
%%sql
 -- نكرر العملية لكافة الجداول
ALTER TABLE honeyProdu
add column New_Values integer;

In [ ]:
%%sql
ALTER TABLE milkProdu
add column New_Values integer;

In [ ]:
%%sql
ALTER TABLE cheeseProdu
add column New_Values integer;

In [ ]:
%%sql
ALTER TABLE YougertProdu
add column New_Values integer;

In [5]:
%%sql
ALTER TABLE coffeeProdu
add column New_Values integer;

 # نسخ القيم كأرقام وحفظها في العمود الجديد

 ### بداية بجدول إنتاج البيض

In [1]:
%%sql
update eggProdu set New_Values = cast(Value as integer)
    where Value not like '%[^0-9]%';

In [9]:
%%sql
 -- test
select new_values from eggProdu;
    -- تم التحويل بنجاح

      New_Values
0      224100000
1      319000000
2      271300000
3       52200000
4      437800000
...          ...
6322  3646000000
6323  3693000000
6324  3899000000
6325  3907000000
6326  3718000000

[6327 rows x 1 columns]

In [ ]:
%%sql
 -- نحذف عمود القيم القديم
alter table eggProdu drop column Value;

 ### ثانياً جدول إنتاج العسل

In [ ]:
%%sql
    -- نكرر العملية لكافة الجداول
update honeyProdu set New_Values = cast(Value as integer)
    where Value not like '%[^0-9]%';

In [10]:
%%sql
alter table honeyProdu drop column Value;

In [12]:
%%sql
 -- test
select new_values from honeyProdu;
    -- تم التحويل بنجاح

      New_Values
0         400000
1        1035000
2        1120000
3       11590000
4        1302000
...          ...
1554     1200000
1555     4125000
1556      861000
1557     8924000
1558     2886000

[1559 rows x 1 columns]

 ### ثالثاً جدول إنتاج الحليب

In [13]:
%%sql
update milkProdu set New_Values = cast(Value as integer)
    where Value not like '%[^0-9]%';

In [14]:
%%sql
alter table milkProdu drop column Value;

In [15]:
%%sql
 -- test
select new_values from milkProdu;
    -- تم التحويل بنجاح

        New_Values
0        428000000
1       3543000000
2        444000000
3        166000000
4        180000000
...            ...
37633   1287000000
37634   1540000000
37635    709000000
37636  10127000000
37637    223000000

[37638 rows x 1 columns]

 ### رابعاً جدول إنتاج الجبن

In [ ]:
%%sql
update cheeseProdu set New_Values = cast(Value as integer)
    where Value not like '%[^0-9]%';

In [16]:
%%sql
alter table cheeseProdu drop column Value;

In [18]:
%%sql
    -- test
select new_values from cheeseProdu;

      New_Values
0      208807000
1       86452000
2        5068000
3       31512000
4       69728000
...          ...
7483    11124000
7484    32966000
7485    32730000
7486    20126000
7487   947591000

[7488 rows x 1 columns]

 ### خامساً جدول إنتاج الزبادي

In [ ]:
%%sql
update YougertProdu set New_Values = cast(Value as integer)
    where Value not like '%[^0-9]%';

In [ ]:
%%sql
alter table YougertProdu drop column Value;

In [20]:
%%sql
    -- test
select new_values from YougertProdu;

     New_Values
0     377839000
1     793256000
2     374637000
3     774881000
4     354906000
..          ...
144    11058000
145   189012000
146     2545000
147    18988000
148    10868000

[149 rows x 1 columns]

 ### أخيراً جدول إنتاج القهوة

In [ ]:
%%sql
update coffeeProdu set New_Values = cast(Value as integer)
    where Value not like '%[^0-9]%';

In [ ]:
%%sql
alter table coffeeProdu drop column Value;

In [21]:
%%sql
    -- test
select new_values from coffeeProdu;

    New_Values
0      5400000
1      6600000
2      7500000
3      8400000
4      7000000
..         ...
66     9375000
67     5375000
68     7375000
69     8738000
70     8625000

[71 rows x 1 columns]

 # خلاصة العمل:
 ### أولاً: تم التأكد من أن قاعدة البيانات تعمل بشكل جيد.
   ### ثانياً: تم معرفة هيكل قاعدة البيانات والتعرف على أنواع القيم لكل عمود .
  ### ثالثاً: تم معرفة البيانات الفارغة وتنظيفها.
 ### رابعاً: رصدنا أحد الأعمدة الرقمية بنوع بيانات نصي .
 ### خامسا: قمنا بإنشاء عمود جديد لتحويل القيم إليه.
 ### سادساً: قمنا بتحويل القيم إلى أرقام وحفظها في العمود الجديد.
 ### سابعاً: قمنا بحذف العمود القديم بعد التحويل.